config.org
** Org-download
:PROPERTIES:
:ID:       0d0e77fb-a3f8-4a24-b3c6-5f5bb380db83
:END:
#+begin_src emacs-lisp
(require 'org-download)
(add-hook 'org-mode-hook 'org-download-enable)
;; Use org-download-method directory is being used by default
(setq-default org-download-image-dir "~/kDrive/BC/Emacs/org/files/images")
(setq org-download-screenshot-method "gnome-screenshot -a -f %s")
(map! :leader
     (:prefix ("D" . "Org-Downloader")
     :desc "Org-Download-Clipboard"
     "c" #'org-download-clipboard
     :leader
     :desc "Org-Download-Yank"
     "y" #'org-download-yank))
#+end_src
* Theme
:PROPERTIES:
:ID:       fe8b9cec-4a55-4934-9816-26b65966beec
:END:
#+begin_src emacs-lisp
;; (setq doom-theme 'doom-dracula)
;; LEUVEN Theme by github.com/fniessen
;; Fontify code in blocks in code blocks
(setq doom-theme 'leuven)
(after! org
  (setq org-src-fontify-natively t)
  ;; Fontify the whole line for headings (with a background color).
  (setq org-fontify-whole-heading-line t)
  ;; Faces for specific TODO keywords.
  (setq org-todo-keyword-faces
        '(("WAIT" . leuven-org-waiting-for-kwd)))
  ;; Mode-line colors
  ;; Org non-standard faces.
  (defface leuven-org-waiting-for-kwd
    '((t :weight bold :box "#89C58F"
         :foreground "#89C58F" :background "#E2FEDE"))
    "Face used to display state WAIT.")
;;  (defface mode-line
;;    '((t (:box (:line-width 1 :color "#1A2F54") :foreground "green" :background "DarkOrange")))
;;    "Orange and green colors in mode-line.")
  )
#+end_src
* Annotate (bastibe@github)
:PROPERTIES:
:ID:       5c9e9521-8e81-47d9-b427-6c3972c28e23
:END:
#+begin_src emacs-lisp
(map! :leader
      :desc "Annotation-Mode"
      "t A" #'annotate-mode)
(map! :leader
 (:prefix ("A" . "Annotations")
      :desc "Annote me"
      "a" #'annotate-annotate
      :leader
      :desc "Refresh"
      "r" #'annotate-load-annotations))
#+end_src
* Xwidget Browser
:PROPERTIES:
:ID:       050cd414-a861-464d-be2f-3880e71a64af
:END:
#+begin_src emacs-lisp
(map! :leader
      :desc "XWidget Browser" "o x" #'xwidget-webkit-browse-url)
#+end_src
* Olivetti
:PROPERTIES:
:ID:       29190963-28f2-4371-888a-33904dd718c2
:END:
#+begin_src emacs-lisp
(map! :leader
      :desc "Olivetti-Mode"
      "t o" #'olivetti-mode
      :leader
      :desc "Olivetti Set Width"
      "b o" #'olivetti-set-width)
(add-hook 'text-mode-hook #'olivetti-mode)
#+end_src

* REGISTERS
:PROPERTIES:
:ID:       6cec0b74-0f0c-4bd6-b0af-a71e16a7a72f
:END:
Emacs registers are compartments where you can save text, rectangles and positions for later use. Once you save text or a rectangle in a register, you can copy it into the buffer once or many times; once you save a position in a register, you can jump back to that position once or many times.  The default GNU Emacs keybindings for these commands (with the exception of counsel-register) involves 'C-x r' followed by one or more other keys.  I wanted to make this a little more user friendly, and since I am using Doom Emacs, I choose to replace the 'C-x r' part of the key chords with 'SPC r'.

| COMMAND                          | DESCRIPTION                      | KEYBINDING |
|----------------------------------+----------------------------------+------------|
| copy-to-register                 | /Copy to register/                 | SPC r c    |
| frameset-to-register             | /Frameset to register/             | SPC r f    |
| insert-register                  | /Insert contents of register/      | SPC r i    |
| jump-to-register                 | /Jump to register/                 | SPC r j    |
| list-registers                   | /List registers/                   | SPC r l    |
| number-to-register               | /Number to register/               | SPC r n    |
| counsel-register                 | /Interactively choose a register/  | SPC r r    |
| view-register                    | /View a register/                  | SPC r v    |
| window-configuration-to-register | /Window configuration to register/ | SPC r w    |
| increment-register               | /Increment register/               | SPC r +    |
| point-to-register                | /Point to register/                | SPC r SPC  |

#+BEGIN_SRC emacs-lisp
(map! :leader
      :desc "Copy to register"
      "r c" #'copy-to-register
      :leader
      :desc "Frameset to register"
      "r f" #'frameset-to-register
      :leader
      :desc "Insert contents of register"
      "r i" #'insert-register
      :leader
      :desc "Jump to register"
      "r j" #'jump-to-register
      :leader
      :desc "List registers"
      "r l" #'list-registers
      :leader
      :desc "Number to register"
      "r n" #'number-to-register
      :leader
      :desc "Interactively choose a register"
      "r r" #'counsel-register
      :leader
      :desc "View a register"
      "r v" #'view-register
      :leader
      :desc "Window configuration to register"
      "r w" #'window-configuration-to-register
      :leader
      :desc "Increment register"
      "r +" #'increment-register
      :leader
      :desc "Point to register"
      "r SPC" #'point-to-register)
#+END_SRC

* WINNER MODE
:PROPERTIES:
:ID:       039ab766-0806-46a1-8f79-5636622e299d
:END:
Winner mode has been included with GNU Emacs since version 20.  This is a global minor mode and, when activated, it allows you to “undo” (and “redo”) changes in the window configuration with the key commands 'SCP w <left>' and 'SPC w <right>'.

#+BEGIN_SRC emacs-lisp
(map! :leader
      :desc "Winner redo"
      "w <right>" #'winner-redo
      :leader
      :desc "Winner undo"
      "w <left>" #'winner-undo)
#+END_SRC
* ORG-ROAM
:PROPERTIES:
:ID:       783bb094-e518-411a-aec8-d435b2bf48f5
:END:
What DOOM left out or broke
#+BEGIN_SRC emacs-lisp
;; Preliminaries as seen in @jethro config.el
(use-package! org-roam
  :init
  (map! :leader
        :prefix "n"
        :desc "org-roam" "l" #'org-roam-buffer-toggle
        :desc "org-roam-graph" "g" #'org-roam-graph
        :desc "org-roam-node-insert" "i" #'org-roam-node-insert
        :desc "org-roam-dailies-goto-date" "d" #'org-roam-dailies-goto-date
        :desc "org-roam-ref-find" "r" #'org-roam-ref-find
        :desc "org-roam-dailies-goto-today" "t" #'org-roam-dailies-goto-today
        :desc "org-roam-dailies-goto-yesterday" "y" #'org-roam-dailies-goto-yesterday
        :desc "org-roam-dailies-capture-today" "j" #'org-roam-dailies-capture-today
        :desc "org-roam-dailies-goto-tomorrow" "T" #'org-roam-dailies-goto-tomorrow
        :desc "org-roam-node-find" "f" #'org-roam-node-find
        :desc "org-roam-capture" "c" #'org-roam-capture)
  (setq org-roam-directory "~/kDrive/BC/Emacs/org"
        org-roam-dailies-directory "daily/"
        org-roam-db-gc-threshold gc-cons-threshold
        org-roam-v2-ack t
        org-id-link-to-org-use-id t
        org-roam-completion-everywhere t
        org-roam-node-display-template "${title:100} ${tags:50}")
  :config
  (org-roam-setup)
  (define-key org-roam-mode-map [mouse-1] #'org-roam-visit-thing)
  (add-to-list 'display-buffer-alist
               '(("\\*org\\*"
                  (display-buffer-in-direction)
                  (direction . right)
                  (window-width . 0.33)
                  (window-height . fit-window-to-buffer))))
(setq org-roam-mode-section-functions
       (list #'org-roam-backlinks-section
             #'org-roam-reflinks-section
             #'org-roam-unlinked-references-section
           ))
(setq org-roam-capture-templates
        '(("d" "default" plain
           "%?"
           :if-new (file+head "${slug}.org"
                              "#+TITLE: ${title}\n#+CREATED: %<%Y-%m-%d>\n#+ROAM_TAGS:\n#+ROAM_ALIASES:\n#+ROAM_REFS\n#+FILETAGS:\n")
           :immediate-finish t
           :unnarrowed t)))
      (setq org-roam-dailies-capture-templates
        '(("d" "default" entry
           "* %?"
           :if-new (file+head "%<%Y-%m-%d>.org"
                              "#+TITLE: %<%A, %e %B %Y>\n#+ROAM_TAGS:\n#+ROAM_ALIASES:\n#+ROAM_REFS\n#+FILETAGS:\n")))
        ))
#+END_SRC
** Org-Roam Server
:PROPERTIES:
:ID:       4e56d29f-0cb7-467f-bde9-bf47d48e3352
:END:
#+BEGIN_SRC emacs-lisp
;;(use-package org-roam-server
;;  :config
;;  (setq org-roam-server-host "127.0.0.1"
;;        org-roam-server-port 8080
;;        org-roam-server-export-inline-images t
;;        org-roam-server-authenticate nil
;;        org-roam-server-network-label-truncate t
;;        org-roam-server-network-label-truncate-length 60
;;        org-roam-server-network-label-wrap-length 20))
#+END_SRC
* Org-Journal
:PROPERTIES:
:ID:       572a5780-2d94-4c30-8278-2a1ba365a233
:END:
#+BEGIN_SRC emacs-lisp
(use-package! org-journal
      :config
      (setq org-journal-dir "~/kDrive/BC/Emacs/org/"
      org-journal-date-prefix "#+TITLE: "
      org-journal-file-format "%Y-%m-%d.org"
      org-journal-date-format "%A, %d %B %Y"
    org-journal-enable-agenda-integration t))
#+END_SRC
